#### 《利用python进行数据分析》第六章

In [5]:
import numpy as np
import pandas as pd
from numpy import nan as NA

In [6]:
df = pd.DataFrame(np.random.rand(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.406759       NaN       NaN
1  0.157626       NaN       NaN
2  0.613341       NaN  0.001800
3  0.313255       NaN  0.397078
4  0.436928  0.989291  0.086376
5  0.674110  0.822776  0.756186
6  0.951890  0.027246  0.533449

In [8]:
df.dropna()

          0         1         2
4  0.436928  0.989291  0.086376
5  0.674110  0.822776  0.756186
6  0.951890  0.027246  0.533449

In [9]:
df.dropna(thresh=2)

          0         1         2
2  0.613341       NaN  0.001800
3  0.313255       NaN  0.397078
4  0.436928  0.989291  0.086376
5  0.674110  0.822776  0.756186
6  0.951890  0.027246  0.533449

In [10]:
df.fillna(0)

          0         1         2
0  0.406759  0.000000  0.000000
1  0.157626  0.000000  0.000000
2  0.613341  0.000000  0.001800
3  0.313255  0.000000  0.397078
4  0.436928  0.989291  0.086376
5  0.674110  0.822776  0.756186
6  0.951890  0.027246  0.533449

In [12]:
df.fillna({1: 2, 2: 3})

          0         1         2
0  0.406759  2.000000  3.000000
1  0.157626  2.000000  3.000000
2  0.613341  2.000000  0.001800
3  0.313255  2.000000  0.397078
4  0.436928  0.989291  0.086376
5  0.674110  0.822776  0.756186
6  0.951890  0.027246  0.533449

In [13]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [14]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [15]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [17]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (35, 100], (35, 100], (35, 100], (25, 35]]
Length: 12
Categories (3, interval[int64]): [(18, 25] < (25, 35] < (35, 100]]

In [18]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 2, 2, 2, 1], dtype=int8)

In [19]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 100]],
              closed='right',
              dtype='interval[int64]')

In [21]:
df1 = pd.DataFrame({'key': ['a', 'a', 'b', 'c', 'd'],
                    'data1': range(5)})
df1

  key  data1
0   a      0
1   a      1
2   b      2
3   c      3
4   d      4

In [23]:
df2 = pd.DataFrame({'key': ['a', 'f', 'g', 'h'],
                    'data2': range(4)})
df2

  key  data2
0   a      0
1   f      1
2   g      2
3   h      3

In [24]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   a      0      0
1   a      1      0

In [27]:
pd.merge(df1, df2, left_on='data1', right_on='data2')

  key_x  data1 key_y  data2
0     a      0     a      0
1     a      1     f      1
2     b      2     g      2
3     c      3     h      3

In [28]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   a    0.0    0.0
1   a    1.0    0.0
2   b    2.0    NaN
3   c    3.0    NaN
4   d    4.0    NaN
5   f    NaN    1.0
6   g    NaN    2.0
7   h    NaN    3.0